## Infrastructure Change Summary

#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation ✔️`success`
#### Plan 📖`success`
<details>

```terraform
To view this run in a browser, visit:
https://app.terraform.io/app/HYTKY/HYTKY/runs/run-4C17pXyoBYiKHrnd

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # digitalocean_droplet.webserver must be replaced
-/+ resource "digitalocean_droplet" "webserver" {
      ~ created_at           = "2024-10-19T18:50:56Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "452716939" -> (known after apply)
      ~ ipv4_address         = "134.209.237.118" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "webserver"
      ~ price_hourly         = 0.00893 -> (known after apply)
      ~ price_monthly        = 6 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:452716939" -> (known after apply)
      ~ user_data            = "ed0a4959aab163ac72cbeee8970fb45f880d1150" -> "e7512ea5c33a23d515b2d6cbf9703ceb29a9a3b4" # forces replacement
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "665e6aa4-9da1-4f0d-a48b-900a3f0883e8" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # digitalocean_record.root will be updated in-place
  ~ resource "digitalocean_record" "root" {
        id       = "1745167252"
        name     = "@"
      ~ value    = "134.209.237.118" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # digitalocean_record.www will be updated in-place
  ~ resource "digitalocean_record" "www" {
        id       = "1740817276"
        name     = "www"
      ~ value    = "134.209.237.118" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ webserver_ipv4_address = "134.209.237.118" -> (known after apply)
  ~ webserver_monthly_cost = 6 -> (known after apply)

Run status: planned and saved (confirmable)
Workspace is unlocked
```

</details>
